
public class question {
	public static void main(String args[]) {
		// 삼항연산자 :: ? (조건문 유사)
		// [조건식] ? [참일 때 제시할 값] : [거짓일 때 제시할 값]
		
//		String st =
//				5 == 10 ? "5==10은 참입니다." : "5==10은 거짓입니다.";
//				5 < 10 ? "5<10은 참입니다." : "5<10은 거짓입니다.";
		
		// 1. String형 변수 st 생성
		String st;
		
		// 2. st의 값 설정
		// st = 5 < 10 ? "5<10은 참입니다." : "5<10은 거짓입니다."
		//		=> 5<10 조건식 참일 때 첫번째 문장, 거짓일 때는 두번째 문장 적용
		
		if(5 < 10) {
			st = "5<10은 참입니다.";
		}else {
			st = "5<10은 거짓입니다.";
		}
		
		System.out.println(st);
	}
}
